#include "stdafx.h"

namespace basedx11{


	//--------------------------------------------------------------------------------------
	//	struct HttpRequest::Impl;
	//	用途: Implクラス
	//--------------------------------------------------------------------------------------
	struct HttpRequest::Impl{
		Impl() {}
		~Impl(){}
	};

	//--------------------------------------------------------------------------------------
	//	class HttpRequest : public Object;
	//	用途: Http要求のカプセルクラス
	//--------------------------------------------------------------------------------------
	//構築と破棄
	HttpRequest::HttpRequest() :
		Object(),
		pImpl(new Impl())
	{}
	HttpRequest::~HttpRequest(){}



}
//end basedx11
